Revit 2024 API
SolidglassBumpEnableType Enumeration
 The enumerated type representing the permitted values for the asset property "SolidglassBumpEnable" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum SolidglassBumpEnableType
Visual Basic
Public Enumeration SolidglassBumpEnableType
Visual C++
public enum class SolidglassBumpEnableType
Members
Member name | Description
None
Rippled
Wavy
Custom
See Also
Autodesk.Revit.DB.Visual Namespace